<a href="https://colab.research.google.com/github/setran11/ds1002-mnd4up/blob/main/homework/week-15.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - Week 15

Complete the following blocks as specified in the directions. Run each cell to return the desired output. Save your notebook back to your GitHub repository and submit the GitHub URL to your notebook for review.

## 1. Create Functions (4 pts)

Create two functions in the cells below, according to the prompts given.

In [1]:
# create a function in R that:
#   1. takes a single integer as an input parameter
#   2. determines whether the integer is even or odd
#   3. returns a character statement "The integer <x> is even" or "The integer <x> is odd" (replace <x> with the actual input provided)
#
# then execute the function twice using two different input values, displaying even and odd results.

odd_or_even <- function(x) { if (x%% 2 == 1) {
  print(paste("The integer", x, "is odd"))
} else {
  print(paste("The integer", x, "is even"))
}
}

In [3]:
odd_or_even(11)

[1] "The integer 11 is odd"

In [4]:
odd_or_even(14)

[1] "The integer 14 is even"

In [27]:
# create a function in R that:
#   1. takes 4 integer input parameters
#   2. returns the mean value of the inputs
#   3. has default values for the 4 input parameters, in case they are not provided when the function is called.
#
# then execute the function twice: once where you provide the input values, and once where you do not.

mean_vars <- function(var1 = 1, var2 = 2, var3 = 3, var4 = 4) {
  mean_of_vars = (var1 + var2 + var3 + var4)/4
  mean_of_vars
}

In [28]:
mean_vars(3, 11, 13, 31)

[1] 14.5

In [30]:
mean_vars()

[1] 2.5

## 2. Plot Data (4 pts)

In the cell below, write the code required to plot from the `msleep` sample data set.

1. Display only animals with body weights of 30 or greater.
2. Group the animals by `order`.
3. Display the mean `sleep_total` for each group in a bar plot.

## 3. Clean and Analyze Data Using R (4 pts)

In the cells below use R to perform the following data cleaning steps on this file:
https://raw.githubusercontent.com/nmagee/ds1002/main/data/social-media-users.csv

1. Remove any duplicate rows.
2. Remove any records where `last_login` or `birthdate` are empty.
3. Display only the records with the 10 highest `follower` counts.
4. Determine counts of users when grouped by continent.

In [ ]:
df <- read.csv("https://raw.githubusercontent.com/nmagee/ds1002/main/data/social-media-users.csv")
df

In [118]:
# remove any duplicate rows
nrow(df[duplicated(df), ])
df2 <- df[!duplicated(df), ]
nrow(df2[duplicated(df2), ])

[1] 318

[1] 0

In [122]:
# remove any records where last_login or birthdate are empty
df2[df2==""] <- NA
df3 <- na.omit(df2)

In [129]:
# display only the records with the 10 highest follower counts
df3 %>%
  arrange(desc(followers)) %>%
  slice(1:10)

   username      full_name            birthdate  email
1  lleckeyb6     Lynne Leckey         4/19/1998  lleckeyb6@tripadvisor.com
2  cduftondy     Celisse Dufton       8/24/1995  cduftondy@ox.ac.uk
3  dbartalin77   Desiree Bartalin     8/23/1993  dbartalin77@usda.gov
4  grivardmp     Gwen Rivard          9/12/1982  grivardmp@google.com.hk
5  kmorriceht    Kitti Morrice        6/3/1995   kmorriceht@privacy.gov.au
6  smacdonnell7o Shoshanna MacDonnell 9/12/2002  smacdonnell7o@toplist.cz
7  ebroomq9      Early Broom          3/10/2000  ebroomq9@fastcompany.com
8  schapell4j    Shepard Chapell      9/3/1993   schapell4j@noaa.gov
9  tbaptiepo     Thorvald Baptie      10/23/1981 tbaptiepo@indiegogo.com
10 nbarbeyq2     Nelson Barbey        12/15/1984 nbarbeyq2@histats.com
   continent followers last_login interests
1  SA        99977     3/14/2021  sports
2  OC        99707     9/26/2021  sports
3  AF        99618     5/30/2022  music
4  OC        99526     4/4/2020   music
5  SA        98936     3/24/2021  sports
6  AS        98760     7/20/2021  music
7  AF        98606     10/22/2023 sports
8  AS        98479     2/14/2021  music
9  OC        98233     5/27/2022  sports
10 OC        98172     6/18/2022  music

In [143]:
# determine counts of users when grouped by continent
df3 %>%
  select(continent) %>%
  count(continent == "OC")

df3 %>%
  select(continent) %>%
  count(continent == "AF")

df3 %>%
  select(continent) %>%
  count(continent == "SA")

df3 %>%
  select(continent) %>%
  count(continent == "AS")

df3 %>%
  select(continent) %>%
  count(continent == "EU")

  continent == "OC" n
1 FALSE             327
2  TRUE              95

  continent == "AF" n
1 FALSE             352
2  TRUE              70

  continent == "SA" n
1 FALSE             353
2  TRUE              69

  continent == "AS" n
1 FALSE             311
2  TRUE             111

  continent == "EU" n
1 FALSE             345
2  TRUE              77